---
kind: type
id: T:Autodesk.Revit.Creation.FamilyInstanceCreationData
source: html/bcd1f300-616b-5a36-9909-5273f99d78c8.htm
---
# Autodesk.Revit.Creation.FamilyInstanceCreationData

A class which wraps the arguments of FamilyInstance for batch creation.

## Syntax (C#)
```csharp
public class FamilyInstanceCreationData
```